Revit 2024 API
BuiltInFailures.RebarFailures.IncompleteShape Property
 Rebar Shape [Family Name] is not fully defined and cannot be loaded into the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IncompleteShape { get; }
Visual Basic
Public Shared ReadOnly Property IncompleteShape As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IncompleteShape {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace